Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: PHP is mainly focused on server-side scripting, so you can do anything any other CGI program can do, such as collect form data, generate dynamic page content, or send and receive cookies.
pt_br: O PHP é focado para ser uma linguagem de script do lado do servidor, portanto, você pode fazer qualquer coisa que outro programa CGI pode fazer, como: coletar dados de formulários, gerar páginas com conteúdo dinâmico ou enviar e receber cookies.

source: But PHP can do much more.
pt_br: Mas o PHP pode fazer muito mais.

source: There are three main fields where PHP scripts are used.
pt_br: Esses são os maiores campos onde os scripts PHP podem se utilizados:

source: Server-side scripting.
pt_br: Script no lado do servidor (server-side).

source: This is the most traditional and main target field for PHP.
pt_br: Este é o mais tradicional e principal campo de atuação do PHP.

source: You need three things to make this work.
pt_br: Você precisa de três coisas para seu trabalho.

source: The PHP parser (CGI or server module), a webserver and a web browser.
pt_br: O interpretador do PHP (como CGI ou módulo), um servidor web e um browser.

source: You need to run the webserver, with a connected PHP installation.
pt_br: Basta rodar o servidor web conectado a um PHP instalado.

source: You can access the PHP program output with a web browser, viewing the PHP page through the server.
pt_br: Você pode acessar os resultados de seu programa PHP com um browser, visualizando a página PHP através do servidor web.

source: See the installation instructions section for more information.
pt_br: Veja as instruções de instalação para maiores informações.

source: Command line scripting.
pt_br: Script de linha de comando.

source: You can make a PHP script to run it without any server or browser.
pt_br: Você pode fazer um script PHP funcionar sem um servidor web ou browser.

source: You only need the PHP parser to use it this way.
pt_br: A única coisa necessária é o interpretador.

source: This type of usage is ideal for scripts regularly executed using cron (on *nix or Linux) or Task Scheduler (on Windows).
pt_br: Esse tipo de uso é ideal para script executados usando o cron ou o Agendador de Tarefas (no Windows).

source: These scripts can also be used for simple text processing tasks.
pt_br: Esses scripts podem ser usados também para rotinas de processamento de texto.

source: See the section about Command line usage of PHP for more information.
pt_br: Veja a seção Utilizando o PHP em linha de comando para maiores informações.

source: Writing client-side GUI applications.
pt_br: Escrevendo aplicações GUI no lado do cliente (client-side).

source: PHP is probably not the very best language to write windowing applications, but if you know PHP very well, and would like to use some advanced PHP features in your client-side applications you can also use PHP-GTK to write such programs.
pt_br: O PHP não é (provavelmente) a melhor linguagem para produção de aplicações com interfaces em janelas, mas o PHP faz isso muito bem, e se você deseja usar alguns recursos avançados do PHP em aplicações no lado do cliente poderá utilizar o PHP-GTK para escrever esses programas.

source: You also have the ability to write cross-platform applications this way.
pt_br: E programas escritos desta forma ainda serão independentes de plataforma.

source: PHP-GTK is an extension to PHP, not available in the main distribution.
pt_br: O PHP-GTK é uma extensão do PHP, não disponível na distribuição oficial.

source: If you are interested in PHP-GTK, visit it 's own website.
pt_br: Se você está interessado no PHP-GTK, visite seu website

source: PHP can be used on all major operating systems, including Linux, many Unix variants (including HP-UX, Solaris and OpenBSD), Microsoft Windows, Mac OS X, RISC OS, and probably others.
pt_br: O PHP pode ser utilizado na maioria dos sistemas operacionais, incluindo Linux, várias variantes Unix (incluindo HP-UX, Solaris e OpenBSD), Microsoft Windows, Mac OS X, RISC OS, e provavelmente outros.

source: This includes Apache, Microsoft Internet Information Server, Personal Web Server, Netscape and iPlanet servers, Oreilly Website Pro server, Caudium, Xitami, OmniHTTPd, and many others.
pt_br: O PHP também é suportado pela maioria dos servidores web atuais, incluindo Apache, Microsoft Internet Information Server, Personal Web Server, Netscape and iPlanet Servers, Oreilly Website Pro Server, Caudium, Xitami, OmniHTTPd, e muitos outros.

source: For the majority of the servers PHP has a module, for the others supporting the CGI standard, PHP can work as a CGI processor.
pt_br: O PHP pode ser configurado como módulo para a maioria dos servidores, e para os outros como um CGI comum.

source: So with PHP, you have the freedom of choosing an operating system and a web server.
pt_br: Com o PHP, portanto, você tem a liberdade para escolher o sistema operacional e o servidor web.

source: Furthermore, you also have the choice of using procedural programming or object oriented programming, or a mixture of them.
pt_br: Do mesmo modo, você pode escolher entre utilizar programação estrutural ou programação orientada a objeto, ou ainda uma mistura deles.

source: Although not every standard OOP feature is realized in the current version of PHP, many code libraries and large applications (including the PEAR library) are written only using OOP code.
pt_br: Mesmo não desenvolvendo nenhum recurso padrão de OOP (Object Oriented Programming, Programação Orientada a Objetos) na versão atual do PHP, muitas bibliotecas de código e grandes aplicações (incluindo a biblioteca PEAR) foram escritos somente utilizando OOP.

source: With PHP you are not limited to output HTML.
pt_br: Com PHP você não está limitado a gerar somente HTML.

source: PHP' s abilities includes outputting images, PDF files and even Flash movies (using libswf and Ming) generated on the fly.
pt_br: As habilidades do PHP incluem geração de imagens, arquivos PDF e animações Flash (utilizando libswf ou Ming) criados dinamicamente, on the fly.

source: You can also output easily any text, such as XHTML and any other XML file.
pt_br: Você pode facilmente criar qualquer padrão texto, como XHTML e outros arquivos XML.

source: PHP can autogenerate these files, and save them in the file system, instead of printing it out, forming a server-side cache for your dynamic content.
pt_br: O PHP pode gerar esses padrões e os salvar no sistema de arquivos, em vez de imprimi-los, formando um cache dinâmico de suas informações no lado do servidor.

source: One of the strongest and most significant feature in PHP is its support for a wide range of databases.
pt_br: Talvez a mais forte e mais significativa característica do PHP é seu suporte a uma ampla variedade de banco de dados.

source: Writing a database-enabled web page is incredibly simple.
pt_br: Escrever uma página que consulte um banco de dados é incrivelmente simples.

source: The following databases are currently supported:
pt_br: Os seguintes bancos de dados são atualmente suportados:

source: PHP also has support for talking to other services using protocols such as LDAP, IMAP, SNMP, NNTP, POP3, HTTP, COM (on Windows) and countless others.
pt_br: O PHP também tem suporte para comunicação com outros serviços utilizando protocolos como LDAP, IMAP, SNMP, NNTP, POP3, HTTP, COM (em Windows) e incontáveis outros.

source: You can also open raw network sockets and interact using any other protocol.
pt_br: Você pode abrir sockets de rede e interagir diretamente com qualquer protocolo.

source: PHP has support for the WDDX complex data exchange between virtually all Web programming languages.
pt_br: O PHP também suporta o intercâmbio de dados complexos WDDX, utilizado em virtualmente todas as linguagens de programação para web.

source: Talking about interconnection, PHP has support for instantiation of Java objects and using them transparently as PHP objects.
pt_br: Falando de comunicação, o PHP implementa a instanciação de objetos Java e os utiliza transparentemente como objetos PHP.

source: You can also use our CORBA extension to access remote objects.
pt_br: Você ainda pode usar sua extensão CORBA para acessar objetos remotos.

source: PHP has extremely useful text processing features, from the POSIX Extended or Perl regular expressions to parsing XML documents.
pt_br: O PHP é extremamente útil em recursos de processamento de texto, do POSIX Estendido ou expressões regulares Perl até como interpretador para documentos XML.

source: For parsing and accessing XML documents, we support the SAX and DOM standards.
pt_br: Para acessar e processar documentos XML, são suportados os padrões SAX e DOM.

source: You can use our XSLT extension to transform XML documents.
pt_br: Você ainda pode usar nossa extensão XSLT para transformar documentos XML.

source: While using PHP in the ecommerce field, you 'll find the Cybercash payment, CyberMUT, VeriSign Payflow Pro and CCVS functions useful for your online payment programs.
pt_br: Utilizando o PHP no campo do e-commerce, você poderá usar as funções específicas para Cybescash, CyberMUT, Verysign Payflow Pro e CCVS, práticos sistemas de pagamento online.

source: At last but not least, we have many other interesting extensions, the mnoGoSearch search engine functions, the IRC Gateway functions, many compression utilities (gzip, bz2), calendar conversion, translation...
pt_br: Por último mas longe de terminar, temos também outras extensões interessantes: funções para o search engine mnoGoSearch, funções para Gateway IRC, vários utilitários de compressão (gzip, bz2), calendário e conversões de datas, tradução...

source: As you can see this page is not enough to list all the features and benefits PHP can offer.
pt_br: Como você pode ver, esta página não é suficiente para descrever todos os recursos e benefícios que o PHP pode oferecer.

source: Read on in the sections about installing PHP, and see the function reference part for explanation of the extensions mentioned here.
pt_br: Leia nas seções sobre a Instalação do PHP, e veja a referência das funções para detalhes das extensões mencionadas aqui.

source: Chapter 14.
pt_br: Capítulo 14.

source: Often you need classes with similar variables and functions to another existing class.
pt_br: Permite classes com variáveis e funções similares a uma outra classe.

source: In fact, it is good practice to define a generic class which can be used in all your projects and adapt this class for the needs of each of your specific projects.
pt_br: De fato, é uma boa prática definir classes genéricas que podem ser utilizadas em todos os seus projetos, e adaptar essas classes com as necessidades específicas de cada projeto.

source: To facilitate this, classes can be extensions of other classes.
pt_br: Para facilitar isso, classes podem ser extensões de outras classes.

source: The extended or derived class has all variables and functions of the base class (this is called'inheritance 'despite the fact that nobody died) and what you add in the extended definition.
pt_br: A classe estendida ou derivada tem todas as variáveis e funções da classe base (isto é chamado herança, afora o fato que ninguém morreu) e mais aquelas que venha a acrescentar na versão estendida.

source: It is not possible to substract from a class, that is, to undefine any existing functions or variables.
pt_br: Não é possível subtrair uma classe, ou seja, indefinir quaisquer funções ou variáveis existentes.

source: An extended class is always dependent on a single base class, that is, multiple inheritance is not supported.
pt_br: Uma classe estendida é sempre dependente de uma única classe base, e portanto, herança múltipla não é suportada.

source: Classes are extended using the keyword 'extends'.
pt_br: Classes são estendidas utilizando a instrução 'extends'.

source: class Named_Cart extends Cart {var $owner; function set_owner ($name) {$this - owner = $name;}}
pt_br: class CarrinhoDeComprasNomeado extends CarrinhoDeCompras {var $proprietario; function set_proprietario ($name) {$this - proprietario = $name;}}

source: This defines a class Named_Cart that has all variables and functions of Cart plus an additional variable $owner and an additional function set_owner().
pt_br: Isto define uma classe chamada CarrinhoDeComprasNomeado que tem todas as variáveis e funções de CarrinhoDeCompras mais a variável $proprietario e uma função set_proprietario().

source: You create a named cart the usual way and can now set and get the carts owner.
pt_br: Você pode criar um carrinho nomeado da maneira usual e configurar e obter o proprietário do carrinho.

source: You can still use normal cart functions on named carts:
pt_br: Você ainda pode continuar utilizando carrinhos normais e carrinhos nomeados:

source: $ncart = new Named_Cart; / / Create a named cart $ncart - set_owner("kris"); / / Name that cart print $ncart - owner; / / print the cart owners name $ncart - add_item("10", 1); / / (inherited functionality from cart)
pt_br: $ncart = new CarrinhoDeComprasNomeado; $ncart - set_proprietario("kris"); print $ncart - proprietario; $ncart - add_item("10", 1); / / (funcionalidade herdade do CarrinhoDeCompras)

source: This is also called a "parent-child" relationship.
pt_br: Isto é chamado relacionamento "pai-filho".

source: You create a class, parent, and use extends to create a new class based on the parent class: the child class.
pt_br: Você cria uma classe pai e utiliza extends para criar uma nova classe baseada na classe pai: sua classe filha.

source: You can even use this new child class and create another class based on this child class.
pt_br: Você ainda pode criar uma nova classe estendida a partir dessa classe filha e assim por diante.

source: Classes must be defined before they are used!
pt_br: As classes precisam ser definidas antes de serem utilizadas!

source: If you want the class Named_Cart to extend the class Cart, you will have to define the class Cart first.
pt_br: Se você estender a classe CarrinhoDeComprasNomeado da classe CarrinhoDeCompras, você precisa antes criar a classe chamada CarrinhoDeCompras.

source: If you want to create another class called Yellow_named_cart based on the class Named_Cart you have to define Named_Cart If you want to create another class called Yellow_named_cart based on the class Named_Cart you have to define Named_Cart first.
pt_br: Se você quiser criar uma outra classe chamada CarrinhoDeComprasNomeadoAmarelo baseada na classe CarrinhoDeComprasNomeado você tem que definir CarrinhoDeComprasNomeado primeiro.

source: To make it short: the order in which the classes are defined is important.
pt_br: Trocando em miúdos: a ordem em que as classes são definidas é importante.

source: Constructors
pt_br: Construtores

source: The following is valid for PHP 4 only.
pt_br: O seguinte é valido para o PHP 4 somente.

source: Sometimes it is useful to refer to functions and variables in base classes or to refer to functions in classes that have not yet any instances.
pt_br: As vezes pode ser útil se referir a funções e variáveis na classe base ou referenciar funções em classes que não possuem qualquer instância.

source: The:: operator is being used for this.
pt_br: O operador:: pode ser utilizado nessas ocasiões.

source: class A {function example() {echo "I am the original function A::example(). br \n";}} class B extends A {function example() {echo "I am the redefined function B::example(). br \n"; A::example();}} / / there is no object of class A. / / this will print / / I am the original function A::example(). br A::example(); / / create an object of class B. $b = new B; / / this will print / / I am the redefined function B::example(). br / / I am the original function A::example(). br $b - example();
pt_br: class A {function exemplo() {echo "Eu sou a função original A::exemplo(). br \n";}} class B extends A {function exemplo() {echo "Eu sou a função redefinida B::exemplo(). br \n"; A::exemplo();}} / / Nao ha nenhum objeto da classe A. / / Isto ira imprimir / / Eu sou a função original A::exemplo(). br A::exemplo(); / / cria um objeto a partir da classe B $b = new B; / / Isto ira imprimir / / Eu sou a função redefinida B::exemplo(). br / / Eu sou a função original A::exemplo(). br $b - exemplo();

source: Instead we call example() as a'class function ', that is, as a function of the class itself, not any object of that class.
pt_br: O exemplo acima chama a função exemplo() da classe A, mas não há nenhum objeto da classe A, então não podemos escrever $a - exemplo() ou qualquer coisa similar, Em vez disso, nós chamamos exemplo() como uma 'função de classe ', ou seja, como uma função da classe propriamente dita, não qualquer objeto dessa classe.

source: There are class functions, but there are no class variables.
pt_br: Existem funções de classe, mas não variáveis de classe.

source: In fact, there is no object at all at the time of the call.
pt_br: De fato, não há nenhum objeto durante toda a execução.

source: Thus, a class function may not use any object variables (but it can use local and global variables), and it may no use $this at all.
pt_br: Assim, uma função de classe não pode usar qualquer variável de objeto (mas pode usar variáveis locais e globais), e nunca podendo utilizar-se de $this.

source: In the above example, class B redefines the function example().
pt_br: Ainda no exemplo acima, a classe B redefine a função exemplo().

source: The original definition in class A is shadowed and no longer available, unless you are refering specifically to the implementation of example() in class A using the ::-operator.
pt_br: A definição da função original na classe A é ocultada e nunca disponível, a não ser que você se referencie especificamente a implementação de exemplo() da classe A utilizando-se do operador::.

source: Write A::example() to do this (in fact, you should be writing parent::example(), as shown in the next section).
pt_br: Escrevemos A::exemplo() para isso (de fato, você também pode escrever parent::exemplo(), como mostrado na próxima seção).

source: In this context, there is a current object and it may have object variables.
pt_br: Nesse contexto, existe um objeto e ele pode ter variáveis de objeto.

source: Thus, when used from WITHIN an object function, you may use $this and object variables.
pt_br: Assim, quando utilizado de DENTRO de uma função de objeto, você pode usar $this e variáveis de objeto.

source: You may find yourself writing code that refers to variables and functions in base classes.
pt_br: Você pode se encontrar escrevendo código que precisa referenciar a variáveis e funções na classe base.

source: This is particularly true if your derived class is a refinement or specialisation of code in your base class.
pt_br: Isto é particularmente verdade se você derivou uma classe como um refinamento ou especialização de código de sua classe base.

source: Instead of using the literal name of the base class in your code, you should be using the special name parent, which refers to the name of your base class as given in the extends Instead of using the literal name of the base class in your code, you should be using the special name parent, which refers to the name of your base class as given in the extends declaration of your class.
pt_br: Fazendo isso, evita assim a utilização do nome da sua classe base em mais de um lugar.

source: Should your inheritance tree change during implementation, the change is easily made by simply changing the extends declaration of your class.
pt_br: Se sua árvore de herança mudar durante a implementação, a modificação é mais facilmente realizada pela simples alteração da declaração extends de suas classes.

source: class A {function example() {echo "I am A::example() and provide basic functionality. br \n";}} class B extends A {function example() {echo "I am B::example() and provide additional functionality. br \n"; parent::example();}} $b = new B; / / This will call B::example(), which will in turn call A::example(). $b - example();
pt_br: class A {function exemplo() {echo "Eu sou A:exemplo() e provenho funcionalidades básicas. br \n";}} class B extends A {function exemplo() {echo "Eu sou B::exemplo() e provenho funcionalidades adicionais. br \n"; parent::exemplo();}} $b = new B; / / Isto ira chamar B::exemplo(), que por sua vez chama A::exemplo(). $b - exemplo();

source: Serializing objects - objects in sessions
pt_br: Serializando objetos - objetos em sessões

source: Keeping Current
pt_br: Próxima

source: Basic syntax
pt_br: Sintaxe básica

source: Chapter 6.
pt_br: Capítulo 6.

source: PHP supports' C', 'C++ 'and Unix shell-style comments.
pt_br: O PHP suporta comentários do 'C', 'C++' e Unix shell.

source: ?php echo "This is a test"; / / This is a one-line c+ + style comment / * This is a multi line comment yet another line of comment * / echo "This is yet another test"; echo "One Final Test"; # This is shell-style style comment?
pt_br: ?php echo "Isto é um teste"; / /Comentário de uma linha no C+ + / * Isto é um comentário de mais de uma linha e aqui temos outra linha * / echo "Isto é um outro teste"; echo "O último teste"; #Comentário no estilo Unix shell?

source: The "one-line" comment styles actually only comment to the end of the line or the current block of PHP code, whichever comes first.
pt_br: Os comentário de uma linha só tem efeito até o fim da linha ou fim do bloco de código PHP atual, o que ocorrer primeiro.

source: h1 This is an ?php # echo "simple";? example. / h1 p The header above will say'This is an example '.
pt_br: h1 Isto é um ?php # echo "simples";? exemplo. / h1 p No título acima você lerá 'Isto é um exemplo '.

source: You should be careful not to nest 'C' style comments, which can happen when commenting out large blocks.
pt_br: Você precisa ser cuidadoso com comentários estilo 'C' encadeados, pois eles podem causar problemas em grandes blocos.

source: ?php / * echo "This is a test"; / * This comment will cause a problem * / * /?
pt_br: ?php / * echo "Isto é um teste"; / * Este comentário causará um erro * / * /?

source: The one-line comment styles actually only comment to the end of the line or the current block of PHP code, whichever comes first.
pt_br: Os comentários de uma linha somente agem até o fim da linha atual ou o fim do bloco de código PHP, o que ocorrer primeiro.

source: This means that HTML code after / /?
pt_br: Isto significa que código HTML após / /?

source: WILL be printed:? skips out of the PHP mode and returns to HTML mode, and / / cannot influence that.
pt_br: SERÁ impresso:? continuará desligando o modo PHP, retornando para o modo HTML, e o / / não pode influenciar isso.

source: Instruction separation
pt_br: Separador de instruções

source: Types
pt_br: Tipos

source: When PHP parses a file, it simply passes the text of the file through until it encounters one of the special tags which tell it to start interpreting the text as PHP code.
pt_br: Sintaxe básica

source: The parser then executes all the code it finds, up until it runs into a PHP closing tag, which tells the parser to just start passing the text through again.
pt_br: Quando o PHP interpreta um arquivo, ele simplesmente repassa o texto do arquivo até encontrar uma das tags especiais que lhe diz para começar a interpretar o texto como código PHP.

source: This is the mechanism which allows you to embed PHP code inside HTML: everything outside the PHP tags is left utterly alone, while everything inside is parsed as code.
pt_br: Este é o mecanismo que permite a inclusão de código PHP dentro do HTML: qualquer coisa fora das tags PHP é deixado como encontrado, enquanto tudo dentro é interpretado e executado.
